# Creating a DataFrame

In [3]:
#Createing DataFrame fro List of Lists

In [2]:
import pandas as pd

In [5]:
list_data = [["C1", 5, "Jakarta"], ["C2", 10, "Bogor"], ["C3", 7, "Tangerang"], ["C4", 0, "Jakarta"]]

In [6]:
df = pd.DataFrame(list_data, columns = ["cust_id", "item_bought", "city"])
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4            0    Jakarta

In [7]:
#Creating DataFrame from Numpy Array

In [8]:
import numpy as np

In [9]:
numpy_data = np.array(list_data)
numpy_data

array([['C1', '5', 'Jakarta'],
       ['C2', '10', 'Bogor'],
       ['C3', '7', 'Tangerang'],
       ['C4', '0', 'Jakarta']], dtype='<U11')

In [10]:
df = pd.DataFrame(numpy_data, columns = ["cust_id", "item_bought", "city"])
df

  cust_id item_bought       city
0      C1           5    Jakarta
1      C2          10      Bogor
2      C3           7  Tangerang
3      C4           0    Jakarta

In [11]:
#Creating DataFrame from Dictionary

In [12]:
dict_data = { "cust_id": ["C1", "C2", "C3", "C4"],
             "item_bought": [5,10,7,10],
             "city": ["Jakarta", "Bogor", "Tangerang", "Jakarta"]}

dict_data

{'cust_id': ['C1', 'C2', 'C3', 'C4'],
 'item_bought': [5, 10, 7, 10],
 'city': ['Jakarta', 'Bogor', 'Tangerang', 'Jakarta']}

In [13]:
df = pd.DataFrame(dict_data)
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [14]:
#Saving a DataFrame

In [15]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [16]:
df.to_csv("customer_info.csv", index = False)

In [17]:
df.to_excel("customer_info.xlsx", index = False)

In [18]:
#Load a DataFrame

In [19]:
df = pd.read_csv("customer_info.csv")
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [20]:
df = pd.read_excel("customer_info.xlsx")
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

## Basic Operations

In [21]:
#Summary Infor

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   cust_id      4 non-null      object
 1   item_bought  4 non-null      int64
 2   city         4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [23]:
#Statistics of Numerical Columns

In [24]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [25]:
df.describe()

       item_bought
count      4.00000
mean       8.00000
std        2.44949
min        5.00000
25%        6.50000
50%        8.50000
75%       10.00000
max       10.00000

In [26]:
#Columns Name

In [27]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [28]:
df.columns

Index(['cust_id', 'item_bought', 'city'], dtype='object')

In [29]:
list(df.columns)

['cust_id', 'item_bought', 'city']

In [30]:
for i in list(df.columns):
    print(i + " ?")

cust_id ?
item_bought ?
city ?

In [31]:
#DataFrame length

In [32]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [33]:
df.shape

(4, 3)

In [34]:
# banyaknya baris
df.shape[0]

4

In [35]:
# banyaknya kolom
df.shape[1]

3

In [36]:
# values of a particular column

In [37]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [38]:
df["cust_id"] # ini namanya tipe pandas series atau vector

0    C1
1    C2
2    C3
3    C4
Name: cust_id, dtype: object

In [39]:
df["item_bought"] # pandas series item_bought

0     5
1    10
2     7
3    10
Name: item_bought, dtype: int64

In [40]:
df["city"]

0      Jakarta
1        Bogor
2    Tangerang
3      Jakarta
Name: city, dtype: object

In [41]:
# Values of several columns

In [42]:
df[["cust_id","item_bought"]] # Ini bukan pandas series, tapi ini masih pandas dataframe

  cust_id  item_bought
0      C1            5
1      C2           10
2      C3            7
3      C4           10

In [43]:
df[["cust_id","city"]]

  cust_id       city
0      C1    Jakarta
1      C2      Bogor
2      C3  Tangerang
3      C4    Jakarta

In [44]:
df[["item_bought","city"]]

   item_bought       city
0            5    Jakarta
1           10      Bogor
2            7  Tangerang
3           10    Jakarta

In [45]:
# First N Row

In [46]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [47]:
df.head() # Secara Default, bakal nunjukkin 5 data

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [48]:
df.head(1)

  cust_id  item_bought     city
0      C1            5  Jakarta

In [49]:
df.head(2) # Bisa dipake buat preview data, soalnya kalau datanya banyak bisa lama nampilinnya

  cust_id  item_bought     city
0      C1            5  Jakarta
1      C2           10    Bogor

In [50]:
# Last N Rows

In [51]:
df.tail()

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [52]:
df.tail(1)

  cust_id  item_bought     city
3      C4           10  Jakarta

In [53]:
df.tail(3)

  cust_id  item_bought       city
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [54]:
# Random N Rows (Kak Stephanie lebih sering pake ini untuk liat random sample biar lebih presentatif)

In [55]:
df.sample() # Klo ga ngasih sample, dia bakal nunjukkin cuma 1 data

  cust_id  item_bought       city
2      C3            7  Tangerang

In [56]:
df.sample(3)

  cust_id  item_bought       city
2      C3            7  Tangerang
1      C2           10      Bogor
3      C4           10    Jakarta

In [57]:
# Sorting Data

In [58]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [59]:
df.sort_values(by = "item_bought", ascending = False)

  cust_id  item_bought       city
1      C2           10      Bogor
3      C4           10    Jakarta
2      C3            7  Tangerang
0      C1            5    Jakarta

In [60]:
df.sort_values(by = "item_bought")

  cust_id  item_bought       city
0      C1            5    Jakarta
2      C3            7  Tangerang
1      C2           10      Bogor
3      C4           10    Jakarta

In [61]:
df.sort_values(by = ["item_bought", "cust_id"], ascending = False) # Mengurutkan berdasarkan dua kolom

  cust_id  item_bought       city
3      C4           10    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
0      C1            5    Jakarta

In [62]:
df.sort_values(by = ["item_bought", "cust_id"], ascending = False).reset_index() # Biar index nya urut, ga acak2an

   index cust_id  item_bought       city
0      3      C4           10    Jakarta
1      1      C2           10      Bogor
2      2      C3            7  Tangerang
3      0      C1            5    Jakarta

In [63]:
df.sort_values(by = ["item_bought", "cust_id"], ascending = False).reset_index(drop = True) # Klo ga butuh index lama

  cust_id  item_bought       city
0      C4           10    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C1            5    Jakarta

In [64]:
# Rename Column

In [65]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [66]:
df.rename(columns = {"cust_id": "customer_id", "item_bought": "num_of_items"})

  customer_id  num_of_items       city
0          C1             5    Jakarta
1          C2            10      Bogor
2          C3             7  Tangerang
3          C4            10    Jakarta

In [67]:
df.columns = ['cust_id2', 'item_bought2', 'city2']
df

  cust_id2  item_bought2      city2
0       C1             5    Jakarta
1       C2            10      Bogor
2       C3             7  Tangerang
3       C4            10    Jakarta

In [68]:
# Converting Data Types

In [69]:
df

  cust_id2  item_bought2      city2
0       C1             5    Jakarta
1       C2            10      Bogor
2       C3             7  Tangerang
3       C4            10    Jakarta

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cust_id2      4 non-null      object
 1   item_bought2  4 non-null      int64
 2   city2         4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [71]:
df["item_bought2"] = df["item_bought2"].astype("float64")

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cust_id2      4 non-null      object
 1   item_bought2  4 non-null      float64
 2   city2         4 non-null      object
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

In [73]:
df["item_bought2"] = df["item_bought2"].astype("int64")

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cust_id2      4 non-null      object
 1   item_bought2  4 non-null      int64
 2   city2         4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [75]:
df["item_bought2"] = df["item_bought2"].astype("object")

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cust_id2      4 non-null      object
 1   item_bought2  4 non-null      object
 2   city2         4 non-null      object
dtypes: object(3)
memory usage: 228.0+ bytes

## Data Filtering

In [77]:
df = pd.DataFrame({
    "cust_id": ["C1","C2","C3","C4","C5","C6","C7","C8","C9","C10"],
    "item_bought": [10,15,20,35,4,10,2,0,9,15],
    "city": ["Bandung","Jakarta","Bogor","Tangerang","Bali","Jakarta","Jakarta","Bandung","Bogor","Jakarta"]
})

df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [78]:
# Loc : Filter data berdasarkan nama dari baris/kolom

In [79]:
# Single Value

df.loc[0,"cust_id"]

'C1'

In [80]:
df.loc[5,"city"]

'Jakarta'

In [81]:
df.loc[1,"item_bought"]

15

In [82]:
# Range of rows / columns

In [83]:
df.loc[0:4, "cust_id"] # tipe data pandas series

0    C1
1    C2
2    C3
3    C4
4    C5
Name: cust_id, dtype: object

In [84]:
df.loc[0:4, ["cust_id", "city"]] # tipe data pandas DataFrame

  cust_id       city
0      C1    Bandung
1      C2    Jakarta
2      C3      Bogor
3      C4  Tangerang
4      C5       Bali

In [85]:
df.loc[2, ["cust_id", "city"]]

cust_id       C3
city       Bogor
Name: 2, dtype: object

In [86]:
# iloc = mirip dengan list(berdasarkan index)

In [87]:
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [88]:
# Single Value

df.iloc[0, 0]

'C1'

In [89]:
df.iloc[2, 2]

'Bogor'

In [90]:
df.iloc[5, 1]

10

In [91]:
df.iloc[0:2, 0]

0    C1
1    C2
Name: cust_id, dtype: object

In [92]:
df.iloc[0:2, 0:2]

  cust_id  item_bought
0      C1           10
1      C2           15

In [93]:
# Filter dataframe with a criteria

In [94]:
# Object

In [95]:
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [96]:
df[(df["city"] == "Jakarta")]

  cust_id  item_bought     city
1      C2           15  Jakarta
5      C6           10  Jakarta
6      C7            2  Jakarta
9     C10           15  Jakarta

In [97]:
df[(df["cust_id"] == "C7")]

  cust_id  item_bought     city
6      C7            2  Jakarta

In [98]:
# Numeric

In [99]:
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [100]:
df[(df["item_bought"] > 10)]

  cust_id  item_bought       city
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
9     C10           15    Jakarta

In [101]:
df[(df["item_bought"] <= 10)]

  cust_id  item_bought     city
0      C1           10  Bandung
4      C5            4     Bali
5      C6           10  Jakarta
6      C7            2  Jakarta
7      C8            0  Bandung
8      C9            9    Bogor

In [102]:
# Negative of a criteria

In [103]:
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [105]:
df[(df["item_bought"] > 10)]

  cust_id  item_bought       city
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
9     C10           15    Jakarta

In [106]:
df[~(df["item_bought"] > 10)] # ini negasinya

  cust_id  item_bought     city
0      C1           10  Bandung
4      C5            4     Bali
5      C6           10  Jakarta
6      C7            2  Jakarta
7      C8            0  Bandung
8      C9            9    Bogor

In [108]:
# Filter dataframe with several criterias (AND)

In [109]:
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [111]:
df[(df["item_bought"] > 10) & (df["city"] != "Bogor")]

  cust_id  item_bought       city
1      C2           15    Jakarta
3      C4           35  Tangerang
9     C10           15    Jakarta

In [112]:
df[~((df["item_bought"] > 10) & (df["city"] != "Bogor"))]

  cust_id  item_bought     city
0      C1           10  Bandung
2      C3           20    Bogor
4      C5            4     Bali
5      C6           10  Jakarta
6      C7            2  Jakarta
7      C8            0  Bandung
8      C9            9    Bogor

In [113]:
# Filter dataframe with several criterias (OR)

In [114]:
df[(df["item_bought"] > 10) | (df["city"] != "Bogor")]

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
9     C10           15    Jakarta

In [115]:
df[~((df["item_bought"] > 10) | (df["city"] != "Bogor"))]

  cust_id  item_bought   city
8      C9            9  Bogor

In [116]:
# Filter with isin operation

In [118]:
list_of_cities = ["Jakarta", "Tangerang", "Depok"]

In [120]:
df[(df["city"].isin(list_of_cities))]

  cust_id  item_bought       city
1      C2           15    Jakarta
3      C4           35  Tangerang
5      C6           10    Jakarta
6      C7            2    Jakarta
9     C10           15    Jakarta

In [121]:
df[(df["city"] == "Jakarta") | (df["city"] == "Tangerang") | (df["city"] == "Depok")]

  cust_id  item_bought       city
1      C2           15    Jakarta
3      C4           35  Tangerang
5      C6           10    Jakarta
6      C7            2    Jakarta
9     C10           15    Jakarta

In [122]:
list_cust = ["C1", "C5", "C7"]

In [123]:
df[(df["cust_id"].isin(list_cust))]

  cust_id  item_bought     city
0      C1           10  Bandung
4      C5            4     Bali
6      C7            2  Jakarta

## Case Study 1

In [3]:
customers = pd.DataFrame({
    "id": [1,2,3,4],
    "name": ["Joe","Henry","Sam","Max"]
})

In [4]:
customers

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [5]:
orders = pd.DataFrame({
    "id": [1,2],
    "customer_id": [3,1]
})

In [6]:
orders

   id  customer_id
0   1            3
1   2            1

In [13]:
id_order_list = list(orders["customer_id"])
id_order_list

[3, 1]

In [15]:
customers[(customers["id"].isin(id_order_list))]

   id name
0   1  Joe
2   3  Sam

In [25]:
df_cust_not_order = customers[~(customers["id"].isin(id_order_list))].sort_values(by="name", ascending = False).reset_index(drop = True)

In [26]:
df_cust_not_order

   id   name
0   4    Max
1   2  Henry

In [29]:
list_name = list(df_cust_not_order["name"])
list_name

['Max', 'Henry']

In [31]:
result = pd.DataFrame({
    "Inactive Customers" : list_name
})

result

  Inactive Customers
0                Max
1              Henry

In [41]:
inactive_customers = pd.DataFrame()
inactive_customers

Empty DataFrame
Columns: []
Index: []

In [42]:
inactive_customers["Inactive Customers"] = customers[~(customers["id"].isin(orders["customer_id"]))]["name"]
inactive_customers = inactive_customers.sort_values(by = "Inactive Customers", ascending = False)
inactive_customers = inactive_customers.reset_index(drop = True)

In [43]:
inactive_customers

  Inactive Customers
0                Max
1              Henry

## Data Aggregation

In [50]:
iris = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/refs/heads/master/iris.csv")

In [51]:
iris.sample(5)

     sepal_length  sepal_width  petal_length  petal_width     species
102           7.1          3.0           5.9          2.1   virginica
21            5.1          3.7           1.5          0.4      setosa
6             4.6          3.4           1.4          0.3      setosa
72            6.3          2.5           4.9          1.5  versicolor
127           6.1          3.0           4.9          1.8   virginica

In [52]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [49]:
# Value Counts

In [53]:
iris["species"].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [54]:
iris["petal_length"].value_counts()

1.4    13
1.5    13
5.1     8
4.5     8
1.6     7
1.3     7
5.6     6
4.7     5
4.9     5
4.0     5
4.2     4
5.0     4
4.4     4
4.8     4
1.7     4
3.9     3
4.6     3
5.7     3
4.1     3
5.5     3
6.1     3
5.8     3
3.3     2
5.4     2
6.7     2
5.3     2
5.9     2
6.0     2
1.2     2
4.3     2
1.9     2
3.5     2
5.2     2
3.0     1
1.1     1
3.7     1
3.8     1
6.6     1
6.3     1
1.0     1
6.9     1
3.6     1
6.4     1
Name: petal_length, dtype: int64